app/Controllers/C_Auth.php

SELECT *
FROM `user`
WHERE `username` = 'hilmanpermana'
 LIMIT 1
---
    public function valid_login()
    {
        $data = $this->request->getPost();

        $user = $this->userModel->where('username', $data['username'])->first();