app/Controllers/C_Transaksi.php

            ];
        }

        $produk = $this->model_barang->whereIn('idkemeja', $idkemeja)->findAll();
---
SELECT *
FROM `kemeja`
WHERE `idkemeja` IN (26)

        foreach ($produk as $p) {
            $cart_qty = $cart[$p['idkemeja']]['qty'];
            $new_stock = $p['stok'] - $cart_qty;
            $this->model_barang->update($p['idkemeja'], ['stok' => $new_stock]);
---
UPDATE `kemeja` SET `stok` = 1
WHERE `kemeja`.`idkemeja` IN ('26')